In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib notebook
import math
sns.set()

In [89]:
train=pd.read_csv('train.csv')
test=pd.read_csv('test.csv')

In [90]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [91]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [92]:
train.describe(include=['O'])

                        Name   Sex    Ticket        Cabin Embarked
count                    891   891       891          204      889
unique                   891     2       681          147        3
top     Cherry, Miss. Gladys  male  CA. 2343  C23 C25 C27        S
freq                       1   577         7            4      644

In [93]:
#seeing the repeated ticket
train['Ticket'].value_counts()

CA. 2343    7
347082      7
1601        7
3101295     6
347088      6
           ..
343275      1
4138        1
C 17369     1
211536      1
33638       1
Name: Ticket, Length: 681, dtype: int64

In [94]:
#seeing datatype
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [95]:
dataset=pd.concat((train,test), axis=0)
dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,NaN,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,NaN,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,NaN,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,NaN,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,NaN,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [96]:
dataset['Familysize']=dataset['SibSp']+dataset['Parch']

In [97]:
dataset.drop(['SibSp','Parch'], axis=1, inplace=True)

In [98]:
Title=[]
for i in range(1309):
    name=dataset['Name'].values[i]
    title=name.split(',')[1].split('.')[0]
    Title.append(title)

Title=pd.Series(Title, index=range(1309), name='Title')

In [99]:
dataset.set_index('PassengerId', inplace=True)

In [100]:
dataset.drop(columns=['Name', 'Ticket', 'Cabin'],inplace=True)

In [101]:
dataset.reset_index(drop=True)
dataset=pd.merge(Title,dataset,left_index=True,right_index=True)
dataset

        Title  Survived  Pclass     Sex   Age      Fare Embarked  Familysize
1         Mrs       0.0       3    male  22.0    7.2500        S           1
2        Miss       1.0       1  female  38.0   71.2833        C           1
3         Mrs       1.0       3  female  26.0    7.9250        S           0
4          Mr       1.0       1  female  35.0   53.1000        S           1
5          Mr       0.0       3    male  35.0    8.0500        S           0
...       ...       ...     ...     ...   ...       ...      ...         ...
1304       Mr       NaN       3  female  28.0    7.7750        S           0
1305     Dona       NaN       3    male   NaN    8.0500        S           0
1306       Mr       NaN       1  female  39.0  108.9000        C           0
1307       Mr       NaN       3    male  38.5    7.2500        S           0
1308   Master       NaN       3    male   NaN    8.0500        S           0

[1308 rows x 8 columns]

In [102]:
dataset['Title'].value_counts()

 Mr              756
 Miss            260
 Mrs             197
 Master           61
 Dr                8
 Rev               8
 Col               4
 Ms                2
 Mlle              2
 Major             2
 Lady              1
 Don               1
 Capt              1
 the Countess      1
 Sir               1
 Jonkheer          1
 Dona              1
 Mme               1
Name: Title, dtype: int64

In [104]:
dataset['Title']

1           Mrs
2          Miss
3           Mrs
4            Mr
5            Mr
         ...
1304         Mr
1305       Dona
1306         Mr
1307         Mr
1308     Master
Name: Title, Length: 1308, dtype: object

In [124]:
title_mapping={"Mr": 0, "Miss": 1, 'Mrs': 2, 
                "Master": 3, "Dr": 3, "Rev": 3, "Col": 3, "Major": 3, "Mlle": 3,"Countess": 3,
                "Ms": 3, "Lady": 3, "Jonkheer": 3, "Don": 3, "Dona" : 3, "Mme": 3,"Capt": 3,"Sir": 3 }
dataset['Title'].map(title_mapping)

1      NaN
2      NaN
3      NaN
4      NaN
5      NaN
        ..
1304   NaN
1305   NaN
1306   NaN
1307   NaN
1308   NaN
Name: Title, Length: 1308, dtype: float64

In [107]:
dataset.isna().sum()

Title           0
Survived      417
Pclass          0
Sex             0
Age           262
Fare            1
Embarked        2
Familysize      0
dtype: int64

In [113]:
dataset.

      Title  Survived  Pclass     Sex   Age     Fare Embarked  Familysize
1       Mrs       0.0       3    male  22.0   7.2500        S           1
2      Miss       1.0       1  female  38.0  71.2833        C           1
3       Mrs       1.0       3  female  26.0   7.9250        S           0
4        Mr       1.0       1  female  35.0  53.1000        S           1
5        Mr       0.0       3    male  35.0   8.0500        S           0
6        Mr       0.0       3    male   NaN   8.4583        Q           0
7    Master       0.0       1    male  54.0  51.8625        S           0
8       Mrs       0.0       3    male   2.0  21.0750        S           4
9       Mrs       1.0       3  female  27.0  11.1333        S           2
10     Miss       1.0       2  female  14.0  30.0708        C           1
11     Miss       1.0       3  female   4.0  16.7000        S           2
12       Mr       1.0       1  female  58.0  26.5500        S           0
13       Mr       0.0       3    male  20.0   8.0500        S           0
14     Miss       0.0       3    male  39.0  31.2750        S           6
15      Mrs       0.0       3  female  14.0   7.8542        S           0

In [ ]:
plt.figure()
sns.countplot(x='Survived', hue='Sex', data=dataset)

In [ ]:
plt.figure()
sns.countplot(x='Survived', hue='Pclass', data=dataset)

In [ ]:
plt.figure()
dataset['Age'].plot.hist()
plt.xlabel('Age')

In [ ]:
plt.figure()
sns.countplot('Familysize', data=dataset)

In [ ]:
plt.figure()
sns.boxplot(x='Pclass', y='Age', data=dataset)

In [ ]:
plt.figure()
sns.boxplot(x='Survived', y='Age', data=dataset)

In [ ]:
plt.figure()
dataset[['Survived','Embarked']

In [ ]:
dataset.fillna(value={'Embarked':'S'},inplace=True)

In [ ]:
dataset.isna().sum()

In [ ]:
dataset.groupby('Pclass')['Age'].median()

In [ ]:
p1=dataset[dataset['Pclass']==1]['Age'].fillna(value=39)

In [ ]:
p2=dataset[dataset['Pclass']==2]['Age'].fillna(value=29)

In [ ]:
p3=dataset[dataset['Pclass']==3]['Age'].fillna(value=24)

In [ ]:
dataset.drop('Age', axis=1, inplace=True)
age=pd.concat([p1,p2,p3], axis=0).sort_index()
dataset=pd.concat([dataset,age], axis=1)

In [ ]:
dataset.isna().sum()

In [ ]:
x=dataset['Fare'].isna()
x[x==True]

In [ ]:
dataset.loc[1044]

In [ ]:
dataset[(dataset['Pclass']==3) & (dataset['Familysize']==0)]['Fare'].median()

In [ ]:
dataset['Fare'].fillna(7.8542, inplace=True)

In [ ]:
dataset.isna().sum()

In [ ]:
dataset=pd.concat([pd.get_dummies(dataset['Title'], drop_first=True), dataset], axis=1)

In [ ]:
dataset=pd.concat([pd.get_dummies(dataset['Embarked'], drop_first=True), dataset], axis=1)

In [ ]:
dataset=pd.concat([pd.get_dummies(dataset['Pclass'], drop_first=True), dataset], axis=1)

In [ ]:
dataset=pd.concat([pd.get_dummies(dataset['Sex'], drop_first=True), dataset], axis=1)

In [ ]:
dataset.drop(['Pclass', 'Embarked', 'Sex','Title'], axis=1, inplace=True)

In [ ]:
dataset.isna().sum()

In [ ]:
dataset

In [ ]:
x=dataset.drop('Survived', axis=1).values
y=dataset['Survived'].values

In [ ]:
train_y=y[:891]

In [ ]:
x

In [ ]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x_scaled=sc.fit_transform(x)

In [ ]:
test_x=x_scaled[891:]
train_x=x_scaled[:891]

In [ ]:
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.ensemble import RandomForestClassifier

In [ ]:
classifier_log=LogisticRegression(max_iter=10000)
classifier_svm=SVC(kernel='rbf',random_state=0)
classifier_knn=KNeighborsClassifier()
classifier_nb=GaussianNB()
classifier_random=RandomForestClassifier(criterion='entropy', random_state=0)

In [ ]:
PassengerId=pd.read_csv('gender_submission.csv')['PassengerId']

In [ ]:
classifier_log.fit(train_x,train_y)
pred_y=classifier_log.predict(test_x).astype(int)
pd.DataFrame({'Survived':pred_y}, index=PassengerId).to_csv('titanic_log.csv')

In [ ]:
classifier_svm.fit(train_x,train_y)
pred_y=classifier_svm.predict(test_x).astype(int)
pd.DataFrame({'Survived':pred_y}, index=PassengerId).to_csv('titanic_svm.csv')

In [ ]:
classifier_knn.fit(train_x,train_y)
pred_y=classifier_knn.predict(test_x).astype(int)
pd.DataFrame({'Survived':pred_y}, index=PassengerId).to_csv('titanic_knn.csv')

In [ ]:
classifier_nb.fit(train_x,train_y)
pred_y=classifier_nb.predict(test_x).astype(int)
pd.DataFrame({'Survived':pred_y}, index=PassengerId).to_csv('titanic_nb.csv')

In [ ]:
classifier_random.fit(train_x,train_y)
pred_y=classifier_random.predict(test_x).astype(int)
pd.DataFrame({'Survived':pred_y}, index=PassengerId).to_csv('titanic_random.csv')